# Factbook Exercise
* The factbook.db database contains some facts about the countries of the world.
* It contains only one table called facts.
* Use this database to answer the following question.

In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

* **Which is the most populated country?**

* **Which is the least populated country?**

* **What's the world's total population (in billions)?**

* **Top 5 countries with the highest population growth?**

* **Top 5 countries with the population_growth higher than average growth?**

* **Which countries have the highest population density?**

In [12]:
%%sql
SELECT *
FROM facts
LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

### QN 1 - Solution

In [4]:
%%sql
SELECT name, MAX(population) AS Population
FROM facts
WHERE name <> "World";

 * sqlite:///factbook.db
Done.

[('China', 1367485388)]

### QN 2- Solution

In [8]:
%%sql
SELECT name, MIN(population) AS Population
FROM facts;

 * sqlite:///factbook.db
Done.

[('Antarctica', 0)]

### QN 3 - Solution

In [9]:
%%sql
SELECT CAST(SUM(population) AS Float)/1000000000 AS Total_pop
FROM facts
WHERE name <> "World";

 * sqlite:///factbook.db
Done.

[(7.770482643,)]

### QN 4 - Solution

In [10]:
%%sql
SELECT name, population_growth
FROM facts
ORDER BY population_growth DESC
LIMIT 5;

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02),
 ('Malawi', 3.32),
 ('Burundi', 3.28),
 ('Niger', 3.25),
 ('Uganda', 3.24)]

### QN 5 - Solution

In [11]:
%%sql
SELECT name, population_growth
FROM facts
WHERE population_growth > (
	SELECT avg(population_growth)
	FROM facts
	)
ORDER BY population_growth DESC
LIMIT 5;

 * sqlite:///factbook.db
Done.

[('South Sudan', 4.02),
 ('Malawi', 3.32),
 ('Burundi', 3.28),
 ('Niger', 3.25),
 ('Uganda', 3.24)]

### QN 6 - Solution

In [13]:
%%sql
SELECT name, ROUND(CAST(population AS Float)/area_land, 2) AS density
FROM facts
ORDER BY density DESC
LIMIT 5;

 * sqlite:///factbook.db
Done.

[('Macau', 21168.96),
 ('Monaco', 15267.5),
 ('Singapore', 8259.78),
 ('Hong Kong', 6655.27),
 ('Gaza Strip', 5191.82)]